Revit 2024 API
DimensionEqualityLabelFormatting.Suffix Property
 The suffix to include after the parameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public string Suffix { get; set; }
Visual Basic
Public Property Suffix As String
	Get
	Set
Visual C++
public:
property String^ Suffix {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace